song_app_api/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "time", "artist", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["time", "howdy"], ["artist", "hello"], ["created_at", "2020-08-06 23:38:18.254823"], ["updated_at", "2020-08-06 23:38:18.254823"]]